diagramas/componentes/componentes.puml
@startuml ComponentesLineaVerde
!theme plain
skinparam componentStyle rectangle
skinparam linetype ortho

package "Canales" {
  [AplicacionMovil] as APPM
  [AplicacionWeb] as APPW
}

package "Borde" {
  [WAF] as WAF
  [ApiGateway] as APIGW
  [Autorizador] as AUTH
}

package "LineaVerde" {
  [OnboardingXPais] as ONBXP
  [CDTXPais] as CDTXP
  [CreditoExpressXPais] as CREDXP
  [Pagos] as PAGOS
  [MotorElegibilidadXPais] as ELIGXP
  [Notificaciones] as NOT
}

package "Externos" {
  [Convenios] as CONV
  [ValidadorIdentidad] as VID
  [CoreBancoZ] as CORE
  [ConsultaProveedores] as CPROV
}

package "Integracion" {
  package "ACL - CapaAntiCorrupcion" {
    [AdaptadorCore] as ADAPT
    [TraductorDominio] as TRAD
    [CircuitBreaker] as CB
  }
  [ChangeDataCapture] as CDC
}

package "Datos" {
  database "AlmacenCDTXPais" as ALCDT
  database "AlmacenCreditoXPais" as ALCRED
  database "AlmacenPagosXPais" as ALPAG
  database "CacheDistribuido" as CACHE
  [ActualizadorCache] as ACTC
}

package "Asincrono" {
  queue "MessageBroker" as BROKER
}

package "Seguridad" {
  database "LogAuditoria" as LOG
  [DetectorFraude] as DET
}

' ===== Canales -> Borde =====
APPM --> WAF
APPW --> WAF
WAF --> APIGW
APIGW --> AUTH

' ===== Borde -> LineaVerde =====
APIGW --> ONBXP
APIGW --> CDTXP
APIGW --> CREDXP
APIGW --> PAGOS

' ===== LineaVerde -> Externos / ACL =====
ONBXP --> VID
CDTXP --> ADAPT
CREDXP --> ELIGXP
CREDXP --> ADAPT
PAGOS --> ADAPT
PAGOS --> CONV
ELIGXP --> CACHE
ELIGXP --> CPROV

' ===== LineaVerde -> Datos =====
CDTXP --> ALCDT
CREDXP --> ALCRED
PAGOS --> ALPAG

' ===== ACL interno =====
ADAPT --> TRAD
ADAPT --> CB
CB --> CORE

' ===== CDC =====
CORE ..> CDC : redo
CDC --> BROKER

' ===== Eventos =====
CDTXP --> BROKER
CREDXP --> BROKER
PAGOS --> BROKER
BROKER --> NOT
BROKER --> ACTC
BROKER --> DET
ACTC --> CACHE

' ===== Seguridad =====
DET --> LOG
DET ..> CDTXP : congelar
CDTXP --> LOG
CREDXP --> LOG
PAGOS --> LOG

' ===== Notificaciones a canales =====
NOT --> APPM
NOT --> APPW

@enduml
